Cookbook.tex
% Created 2025-02-05 Wed 13:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=.75in]{geometry}
\usepackage{tikz}
\usepackage{graphicx}
\setcounter{secnumdepth}{2}
\author{Jachin Minyard}
\date{\today}
\title{Cookbook}
\hypersetup{
 pdfauthor={Jachin Minyard},
 pdftitle={Cookbook},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle

Each recipe by default makes what I would call 1 serving with one serving being enough for a family of 4 most of the time.
\section{Breads}
\label{sec:org5f9f5b1}
\subsection{Monkey Bread}
\label{sec:org7f68573}
\subsection{Pumpkin Bread}
\label{sec:org5da95eb}
\subsection{Banana Bread}
\label{sec:orgbb9be8f}
\section{Ethiopian}
\label{sec:org82c9c39}
\subsection{Misir Wot}
\label{sec:org078921a}
\subsubsection*{Ingredients}
\label{sec:orgbfe5001}
\begin{itemize}
\item 4 tbsp Spoons of Niter Kibbeh
\item 1 Large Yellow Onion, Diced
\item 3 cloves of garlic, Minced
\item 1 Roma Tomato, Finely Chopped
\item 3 tbsp of Tomato Paste
\item 2 tbsp Spoons of Berbere
\item 1 Cup of Red Lentils
\item 2 1/2 Cups of Broth (chicken or vegetable)
\item 1 tsp of salt
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgb91c31e}
\begin{enumerate}
\item Melt 3 tbsp of Niter Kibbeh in a large pot over medium heat.
\item Add onions and cook for around 8-10 mins or until golden brown
\item Add garlic, tomatoes, tomato paste, and 1 tbsp of Berbere. Cook for 5-8 mins or until the tomatoes have cooked down a bit.
\item Add Lentils and broth. Bring to a boil and then reduce to a simmer. Cook for 30-40 mins or until the lentils are soft. (stir occasionally)
\item Stir in the rest of the niter kibbeh and berbere. Add salt to taste.
\end{enumerate}
\subsection{Shiro Powder}
\label{sec:org4425453}
\subsubsection*{Ingredients}
\label{sec:org4aae416}
\begin{itemize}
\item 3/4 Cup of Chickpea Flour
\item 1 tbsp berbere
\item 1 tsp ground cardamom
\item 1 tsp cumin powder
\item 1 tsp garlic powder
\item 1tsp salt
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgded1e15}
\begin{enumerate}
\item on skillet dry roast the ingredients
\end{enumerate}

\subsection{Shiro Wot}
\label{sec:org27386d7}
\subsubsection*{Ingredients}
\label{sec:org6892dad}
\begin{itemize}
\item 1 cup Shiro Powder
\item 3 tbsp of Niter Kibbeh
\item 1 large onion, diced
\item 1 tsp of garlic, minced
\item 2 roma tomatoes, finely chopped
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgbf306d3}
\begin{enumerate}
\item Add the Niter Kibbeh to a pot and melt over medium heat.
\item Add the onions and cook for 8-10 mins till caramelized.
\item Add the tomatoes and garlic. Cook till reduced stirring occasionally.
\item Add the Shiro Powder and stir till there are no more dry lumps.
\item Add 2 cups of water and bring to a boil. Reduce to a simmer and cook for 20-30 mins.
\end{enumerate}

\subsection{Tikil Gomen}
\label{sec:org2d13869}
\subsubsection*{Ingredients}
\label{sec:orgbdb9733}
\begin{itemize}
\item 

\item 

\item 

\item 
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgdf9d3db}
\begin{enumerate}
\item 

\item 

\item 

\item 
\end{enumerate}
\subsection{Ye'abasha Gomen}
\label{sec:org0d243f0}
\subsubsection*{Ingredients}
\label{sec:orgfebd55a}
\begin{itemize}
\item 10 ounces of collard greens, chopped
\item 3 tbsp of Niter Kibbeh
\item 1 1/2 tsp of ginger, minced
\item 2 tsp of garlic, minced
\item 1 large white onion diced
\item 1 tsp of smoked paprika
\item 1/2 tsp of cardamon
\item 1 tsp of coriander/cumin
\item 1-2 fresh chili peppers, minced
\item 2 tbsp of lemon juice
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orga50aedd}
\begin{enumerate}
\item Add Niter Kibbeh, garlic, ginger, peppers, and other dried spices to a large skillet and saute for 30 sec. Don't burn them!
\item Add the onions and mix well. Saute for another 5 min.
\item Toss in the collared greens and lemon juice. Turn down heat and cook till collared greens are wilted.
\end{enumerate}

\subsection{Fasollia}
\label{sec:org2a7f672}
\subsubsection*{Ingredients}
\label{sec:orgee04778}
\begin{itemize}
\item 1lb of green beans, chopped (remove the ends)
\item 1lb of carrots, julienned (cut longways into strips)
\item 1 medium onion, diced
\item 1 tbsp of garlic, minced
\item 1 tsp of ginger, grated
\item 2 tbsp of Niter Kibbeh
\item salt as needed
\item 1/4 cup of water (more as needed).
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orga713898}
\begin{enumerate}
\item Add the green beans to a pan and cook till they start to brown and reduce. add a little salt, The idea is to dry them out as much as possible.
\item Take the green beans out and set aside.
\item Add the niter kibbeh to the pan and add onions. Cook for about 5 mins.
\item Add the garlic and ginger. Cook for another 2 mins
\item Add the carrots and water and simmer for about 10 mins. Stir occasionally, add more water as needed.
\item Add the green beans back and simmer over medium heat for another 10 mins.
\end{enumerate}

\subsection{Niter Kibbeh}
\label{sec:org97ec25c}
\subsubsection*{Ingredients}
\label{sec:org93218ed}
\begin{itemize}
\item 1 lb unsalted butter
\item 1/4 yellow onion, minced
\item 3 tbsp of garlic, minced
\item 2 tbsp of ginger, minced
\item 1 2in cinnamon stick
\item 1 tsp black peppercorn, whole
\item 3 black cardamom pods, whole
\item 1 tsp fenugreek seeds
\item 1 tsp coriander seeds
\item 1 tsp dried oregano
\item 1/2 tsp cumin seeds
\item 1/4 tsp ground nutmeg
\item 1/4 tsp ground turmeric
\item 1 tbsp of Beso Bila (Ethiopian basil)
\item 1 tbsp of Kosseret (Ethiopian herb)
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org06558bc}
\begin{enumerate}
\item place dry herbs on a skillet and roast till fragment. Careful not to scorch the spices.
\item Place all ingredients in a saucepan bring to a low simmer and cook for 60-90 mins. Careful not to burn the butter or it will become bitter.
\item Pour through cheese cloth to strain out all the herbs and spices. Place in an airtight jar and store it.
\end{enumerate}
\section{Indian}
\label{sec:orgd2e2248}
\subsection{Yellow Dal}
\label{sec:orgcde2acd}
\subsubsection*{Ingredients}
\label{sec:org003cc2e}
\subsubsection*{Instructions}
\label{sec:org90606aa}
\subsection{Masala paste}
\label{sec:org48049ea}
\subsubsection*{Ingredients}
\label{sec:org7a4941c}
\begin{itemize}
\item 1 cup coconut, grated
\item 8 cashews
\item 1 in or ginger
\item 1 clove of garlic
\item 2 green chili's
\item 2 tbsp poppy seeds
\item 1 tsp coriander seeds
\item 1/2 tsp fennel
\item handful of coriander
\item 1/4 cup of water
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orge065105}
\begin{enumerate}
\item put ingredients and water in a food processor and blend till smooth. add water as needed.
\end{enumerate}
\subsection{Veggie Korma}
\label{sec:orgc8a9940}
\subsubsection*{Ingredients}
\label{sec:org89072c3}
\begin{itemize}
\item 4 tsp of olive oil
\item 1 bay leaf
\item 1 2in cinnamon stick
\item 2 pod of cardamon or 1/2 tsp of cardamon seeds
\item 3 cloves
\item 1 yellow onion, finely chopped
\item 1 roma tomato, finely chopped
\item 1 carrot, chopped or handful of baby carrots, chopped
\item 

\item 

\item 
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org1df3a2b}
\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}
\subsection{Chicken Curry}
\label{sec:org8173fc8}
\subsubsection*{Ingredients}
\label{sec:org0424ae3}
\begin{itemize}
\item 1 1/2 red onion
\item 2 curry peppers
\item 1 Roma Tomato
\item 6 chicken tenderloins
\item 1 tbsp Ginger Garlic paste
\item 2 cups of water.
Spices:
\item chilli powder
\item turmeric
\item cumin
\item coriander
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgf05e904}
\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}
\subsection{Andhra Chicken Curry}
\label{sec:orgc9fdb05}
Chicken curry but in a pressure cooker.
\subsubsection*{Ingredients}
\label{sec:orgb3e89da}
\begin{itemize}
\item 2 tbsp Oil
\item 1 red onion
\item 3 curry peppers
\item 1 Roma Tomato
\item 6 chicken tenderloins
\item 1 tbsp Ginger Garlic paste
\item 1 cup of water
\item 4 tsp of salt
\item chili powder
\item turmeric
\item cumin
\item coriander
\item Gram masala
\item Chicken masala
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgdcc3cb3}
\begin{enumerate}
\item Add oil to a pressure pot
\item Add the onion and a little bit of salt.
\item Add the curry Peppers
\item Add the Ginger Garlic Paste and mix well.
\item Add Chopped Chicken to the pot. add another 2tsp of salt
\item Add Spices.
\item Add tomato and mix
\item Bring to boil and then pressurize. Cook for 10  mins
\end{enumerate}

\section{Thai}
\label{sec:org44c5a91}
\section{Mexican}
\label{sec:orga5c927a}
\section{Italian}
\label{sec:orgc3f7855}
\section{Spice Mixes}
\label{sec:org9e8d54e}
\end{document}
